Revit 2026 API

# GroupLoadOptionsReplaceDuplicatedGroups Property

---

If there are groups with the same names in source and destination documents set this property to  to replace existing groups, otherwise the operation will be canceled. The default value is .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ReplaceDuplicatedGroups { get; set; }
```
```vb
Public Property ReplaceDuplicatedGroups As Boolean
	Get
	Set
```
```cpp
public:
property bool ReplaceDuplicatedGroups {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ReplaceDuplicatedGroups : bool with get, set
```

#### Property Value

Boolean

#### Reference

GroupLoadOptions Class

Autodesk.Revit.DB Namespace